tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "openssl@1.1"
brew "readline"
brew "asdf"
brew "gdbm"
brew "libffi"
brew "bison"
brew "chezmoi"
brew "chruby"
brew "doctl"
brew "entr"
brew "fd"
brew "gnupg"
brew "go"
brew "iperf3"
brew "jq"
brew "mosquitto"
brew "pwgen"
brew "rpm2cpio"
brew "ruby-install"
brew "smartmontools"
brew "starship"
brew "the_silver_searcher"
brew "tree"
brew "wget"
cask "1password-cli"
cask "arq"
cask "autodesk-fusion360"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "fantastical"
cask "font-fira-code"
cask "google-chrome"
cask "istumbler"
cask "launchbar"
cask "little-snitch"
cask "netnewswire"
cask "obsidian"
cask "openscad"
cask "raspberry-pi-imager"
cask "rectangle"
cask "remoteviewer"
cask "rowanj-gitx"
cask "signal"
cask "slack"
cask "soulver"
cask "syncthing"
cask "textmate"
cask "the-unarchiver"
cask "ultimaker-cura"
cask "utm"
cask "visual-studio-code"
cask "zoom"
